//=============================================================================
//
// 3Dモデルクラス(model3D.h)
// Author : 唐﨑結斗
// 概要 : 3Dモデル生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "application.h"
#include "renderer.h"
#include "test_stencil.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : 3Dモデルを生成する
//=============================================================================
CTestStencil *CTestStencil::Create(void)
{
	// オブジェクトインスタンス
	CTestStencil *pTestStencil = nullptr;

	// メモリの解放
	pTestStencil = new CTestStencil;

	// メモリの確保ができなかった
	assert(pTestStencil != nullptr);

	// 数値の初期化
	pTestStencil->Init();

	// インスタンスを返す
	return pTestStencil;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CTestStencil::CTestStencil()
{

}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CTestStencil::~CTestStencil()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CTestStencil::Init()
{
	// 初期化
	CBG::Init();

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CTestStencil::Uninit()
{
	// 終了
	CBG::Uninit();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 2D更新を行う
//=============================================================================
void CTestStencil::Update()
{
	// 更新
	CBG::Update();
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 2D描画を行う
//=============================================================================
void CTestStencil::Draw()
{// レンダラーのゲット
	CRenderer *pRenderer = CApplication::GetRenderer();

	// ステンシルマスクの設定
	pRenderer->SetStencilMask(1, D3DCMP_ALWAYS);

	// 描画
	CBG::Draw();
}
